# Preparing Time Series from Wide-From Data
Kailin Kleintjes

# Tasks
Zillow House Value Index (ZHVI) https://www.zillow.com/research/data/

Specifically,using the Home Value data set for:

- Data Type = "ZHVI All Homes (SFR+Condo/Coop) - Time Series Smoothed - Seasonally Adjusted"
- Geography = "City"
We have already downloaded the file for you and uploaded it to Google Drive.

Direct URL (for Pandas): https://docs.google.com/spreadsheets/d/e/2PACX-1vQN3Ksa9szQuO4G1-msXWAp17KtVHQCBnuEieu_auu1wSiBf3-krHusIx5VBMkihxj-KZLBosDIGEyR/pub?output=csv

# Imports

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib.dates as mdates
from matplotlib.ticker import FuncFormatter
import seaborn as sns

url ="Data/City_zhvi_uc_sfrcondo_tier_0.33_0.67_sm_sa_month.csv"
df = pd.read_csv(url)
df.head(2)

,RegionID,SizeRank,RegionName,RegionType,StateName,State,Metro,CountyName,2000-01-31,2000-02-29,...,2021-12-31,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30
0,6181,0,New York,city,NY,NY,"New York-Newark-Jersey City, NY-NJ-PA",Queens County,253690.0,255517.0,...,741586.0,745686.0,750578.0,756734.0,762321.0,768797.0,773944.0,777692.0,779960.0,781622.0
1,12447,1,Los Angeles,city,CA,CA,"Los Angeles-Long Beach-Anaheim, CA",Los Angeles County,234181.0,234401.0,...,924019.0,928991.0,937936.0,953874.0,973168.0,990391.0,992337.0,992630.0,978196.0,966595.0

In [2]:
#Filter the 4 largest cities into a new dataframe.
df1=df[df['SizeRank']<4]
df1.head(2)

,RegionID,SizeRank,RegionName,RegionType,StateName,State,Metro,CountyName,2000-01-31,2000-02-29,...,2021-12-31,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30
0,6181,0,New York,city,NY,NY,"New York-Newark-Jersey City, NY-NJ-PA",Queens County,253690.0,255517.0,...,741586.0,745686.0,750578.0,756734.0,762321.0,768797.0,773944.0,777692.0,779960.0,781622.0
1,12447,1,Los Angeles,city,CA,CA,"Los Angeles-Long Beach-Anaheim, CA",Los Angeles County,234181.0,234401.0,...,924019.0,928991.0,937936.0,953874.0,973168.0,990391.0,992337.0,992630.0,978196.0,966595.0

In [3]:
#Melting wide form into long form
df1 = pd.melt(df1.drop(columns = ["RegionID", "SizeRank", "RegionType", "StateName",
                                         "State", "Metro", "CountyName"]), id_vars=["RegionName"],
                  value_name="Value",var_name="Date")
df1.head(2)

    RegionName        Date     Value
0     New York  2000-01-31  253690.0
1  Los Angeles  2000-01-31  234181.0

In [4]:
#convert to datetime
df1['Date'] = pd.to_datetime(df1['Date'])
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1092 entries, 0 to 1091
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   RegionName  1092 non-null   object
 1   Date        1092 non-null   datetime64[ns]
 2   Value       1087 non-null   float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 25.7+ KB

In [5]:
# Set index to datetime
df1 = df1.set_index('Date')
df1.head()

             RegionName     Value
Date
2000-01-31     New York  253690.0
2000-01-31  Los Angeles  234181.0
2000-01-31      Houston  109068.0
2000-01-31      Chicago  166139.0
2000-02-29     New York  255517.0

In [16]:
rsdf= df1.groupby('RegionName').resample("MS").sum()
rsdf

C:\Users\klein\AppData\Local\Temp\ipykernel_13960\2575880954.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  rsdf= df1.groupby('RegionName').resample("MS").sum()

                          Value
RegionName Date
Chicago    2000-01-01  166139.0
           2000-02-01  166536.0
           2000-03-01  167368.0
           2000-04-01  168826.0
           2000-05-01  170499.0
...                         ...
New York   2022-05-01  768797.0
           2022-06-01  773944.0
           2022-07-01  777692.0
           2022-08-01  779960.0
           2022-09-01  781622.0

[1092 rows x 1 columns]

# Part 2

In [18]:
usrsdf = rsdf.unstack(level=0)
usrsdf.head(2)

               Value
RegionName   Chicago   Houston Los Angeles  New York
Date
2000-01-01  166139.0  109068.0    234181.0  253690.0
2000-02-01  166536.0  109079.0    234401.0  255517.0

# 1) Which City had the highest Typical Home Value at the end of 2008? Which had the least?

# 2) How much did the home values change from November 2008 to December 2008 (in dollars)?